app/controllers/communities_controller.rb

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_community
      @community = Community.find(params[:id])